public/service_SapEgrQosQueueStatsLogRecord_acceso.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <header xmlns="xmlapi_1.0">
         <security>
            <user>C12285</user>
            <password hashed="false">Peru2018#</password>
         </security>
         <requestID>aquiroga:0001</requestID>
      </header>
   </SOAP:Header>
   <SOAP:Body>
      <find xmlns="xmlapi_1.0">
         <fullClassName>service.SapEgrQosQueueStatsLogRecord</fullClassName>
         <filter>
           <and>
            <or>
             <between name="timeCaptured" first="1552353028000" second="1552356628000"></between>
            </or>
            <not>
             <or>
              <wildcard name="displayedName" value="Channel%"></wildcard>
              <wildcard name="displayedName" value="system%"></wildcard>
              <wildcard name="displayedName" value="loopback%"></wildcard>
             </or>
            </not>
          </and>
         </filter>
         <resultFilter>
            <attribute>monitoredObjectSiteName</attribute>
            <attribute>displayedName</attribute>
            <attribute>queueId</attribute>
            <attribute>droppedInProfOctets</attribute>
            <attribute>droppedOutProfOctets</attribute>
            <attribute>forwardedInProfOctets</attribute>
            <attribute>forwardedOutProfOctets</attribute>
            <attribute>monitoredObjectPointer</attribute>
            <attribute>timeCaptured</attribute>
            <children/>
         </resultFilter>
      </find>
   </SOAP:Body>
</SOAP:Envelope>
